geo_logs = [
    {'visit1': ['Москва', 'Россия']},  #0
    {'visit2': ['Дели', 'Индия']},  #1
    {'visit3': ['Владимир', 'Россия']},  #2
    {'visit4': ['Лиссабон', 'Португалия']},  #3
    {'visit5': ['Париж', 'Франция']},  #4
    {'visit6': ['Лиссабон', 'Португалия']},  #5
    {'visit7': ['Тула', 'Россия']},  #6
    {'visit8': ['Тула', 'Россия']},  #7
    {'visit9': ['Курск', 'Россия']},  #8
    {'visit10': ['Архангельск', 'Россия']} #9
]

del geo_logs[5], geo_logs[4], geo_logs[3], geo_logs[1]
print(*geo_logs, sep="\n")